---
kind: property
id: P:Autodesk.Revit.DB.FabricationService.Name
source: html/1d2005ff-1410-f076-1020-67e4579d2075.htm
---
# Autodesk.Revit.DB.FabricationService.Name Property

The name of the service.

## Syntax (C#)
```csharp
public string Name { get; }
```